---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.GetPipeFittingAndAccessoryData
source: html/d041a923-d03e-261c-1cb8-ded10b40284d.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.GetPipeFittingAndAccessoryData Method

Gets the fitting data stored in the UI data item.

## Syntax (C#)
```csharp
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
```

## Returns
The fitting data stored in the UI data item.